sglang_sala_profiling/results/minicpm_flashinfer/c64/bench_baseline.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31333, dataset_name='custom', dataset_path='/opt/oldMoney-Project/bench/competition_bench_64.jsonl', model=None, served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31333, dataset_name='custom', dataset_path='/opt/oldMoney-Project/bench/competition_bench_64.jsonl', model='/opt/model_gptq_int4_dense_smooth', served_model_name=None, tokenizer=None, num_prompts=64, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 3885243
#Output tokens: 409876
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 64/64 [15:00<00:00, 14.07s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 not set   
Successful requests:                     64        
Benchmark duration (s):                  900.48    
Total input tokens:                      3885243   
Total input text tokens:                 3885243   
Total generated tokens:                  409876    
Total generated tokens (retokenized):    409796    
Request throughput (req/s):              0.07      
Input token throughput (tok/s):          4314.63   
Output token throughput (tok/s):         455.17    
Peak output token throughput (tok/s):    2037.00   
Peak concurrent requests:                64        
Total token throughput (tok/s):          4769.80   
Concurrency:                             44.82     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   630650.63 
Median E2E Latency (ms):                 569966.51 
P90 E2E Latency (ms):                    828568.68 
P99 E2E Latency (ms):                    893930.14 
---------------Time to First Token----------------
Mean TTFT (ms):                          188909.22 
Median TTFT (ms):                        130675.83 
P99 TTFT (ms):                           526659.73 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          952.46    
Median TPOT (ms):                        177.20    
P99 TPOT (ms):                           8630.90   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           68.99     
Median ITL (ms):                         15.06     
P95 ITL (ms):                            25.02     
P99 ITL (ms):                            31.22     
Max ITL (ms):                            527683.47 
==================================================